TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_syncbridgempu.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR7_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR7_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR7_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR8_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR8_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR8_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR8_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR8_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR8_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR8_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR8_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR8_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR8_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR8_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR8_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR8_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR8_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR8_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR8_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR8_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR9_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR9_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR9_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR9_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR9_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR9_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR9_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR9_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR9_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR9_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR9_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR9_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR9_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR9_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR9_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR9_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR9_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR10_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR10_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR10_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR10_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR10_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR10_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR10_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR10_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR10_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR10_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR10_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR10_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR10_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR10_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR10_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR10_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR10_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR11_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR11_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR11_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR11_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR11_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR11_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR11_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR11_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR11_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR11_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR11_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR11_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR11_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR11_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR11_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR11_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR11_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR12_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR12_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR12_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR12_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR12_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR12_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR12_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR12_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR12_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR12_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR12_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR12_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR12_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR12_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR12_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR12_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR12_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR13_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR13_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR13_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR13_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR13_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR13_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR13_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR13_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR13_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR13_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR13_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR13_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR13_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR13_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR13_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR13_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR13_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR14_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR14_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR14_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR14_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR14_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR14_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR14_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR14_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR14_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR14_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR14_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR14_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR14_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR14_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR14_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR14_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR14_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR15_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR15_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR15_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR15_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR15_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR15_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR15_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR15_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR15_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR15_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR15_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR15_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR15_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR15_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR15_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR15_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR15_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR16_START register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR16_START_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR16_START_ADDRL_M   0xF000U       // Lower Start Address
#define SYNCBRIDGEMPU_MPUR16_START_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR16_START_ADDRH_M   0xFFFF0000U   // Upper Start Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR16_END register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR16_END_ADDRL_S   12U
#define SYNCBRIDGEMPU_MPUR16_END_ADDRL_M   0xF000U       // Lower End Address
#define SYNCBRIDGEMPU_MPUR16_END_ADDRH_S   16U
#define SYNCBRIDGEMPU_MPUR16_END_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR16_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR16_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR16_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR16_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUR16_ACCESS register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUR16_ACCESS_ACCESS_S   0U
#define SYNCBRIDGEMPU_MPUR16_ACCESS_ACCESS_M   0x3U   // Region Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUCTRL register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUCTRL_MPUEN   0x1U   // Enable MPU function

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUCFG_LOCK register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUCFG_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the MPUCFG_COMMIT register
//
//*************************************************************************************************
#define SYNCBRIDGEMPU_MPUCFG_COMMIT_COMMIT   0x1U   // Permanent Commit



#endif
